Masmiseim36/nxpSDK/boards/mimxrt700evk/driver_examples/xspi/psram/edma_transfer/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.2412.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitPsRamPins_Xspi1();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0/LP_FLEXCOMM0_P1/SCT0_OUT9/CTIMER4_MAT1, input_buffer: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t port0_pin31_config = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(0U, 31U, port0_pin31_config);

    const uint32_t port1_pin0_config = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: N5) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(1U, 0U, port1_pin0_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPsRamPins_Xspi2:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D9, peripheral: XSPI2, signal: 'DATA, 0', pin_signal: PIO4_1/XSPI2_DATA0/LP_FLEXCOMM8_P1/LCD_D20, input_buffer: enable}
  - {pin_num: C10, peripheral: XSPI2, signal: 'DATA, 2', pin_signal: PIO4_3/XSPI2_DATA2/LP_FLEXCOMM8_P3/LCD_D22, input_buffer: enable}
  - {pin_num: C11, peripheral: XSPI2, signal: 'DATA, 1', pin_signal: PIO4_2/XSPI2_DATA1/LP_FLEXCOMM8_P2/LCD_D21, input_buffer: enable}
  - {pin_num: C9, peripheral: XSPI2, signal: 'DATA, 3', pin_signal: PIO4_4/XSPI2_DATA3/LP_FLEXCOMM8_P4/LCD_D23, input_buffer: enable}
  - {pin_num: C8, peripheral: XSPI2, signal: 'DATA, 4', pin_signal: PIO4_6/XSPI2_DATA4/LP_FLEXCOMM8_P6/LCD_D16, input_buffer: enable}
  - {pin_num: C13, peripheral: XSPI2, signal: 'DATA, 5', pin_signal: PIO4_7/XSPI2_DATA5/LP_FLEXCOMM9_P0/LCD_D17, input_buffer: enable}
  - {pin_num: B12, peripheral: XSPI2, signal: 'DATA, 6', pin_signal: PIO4_8/XSPI2_DATA6/LP_FLEXCOMM9_P1/LCD_D18, input_buffer: enable}
  - {pin_num: C12, peripheral: XSPI2, signal: 'DATA, 7', pin_signal: PIO4_9/XSPI2_DATA7/LP_FLEXCOMM9_P2/LCD_D19, input_buffer: enable}
  - {pin_num: F11, peripheral: XSPI2, signal: 'DATA, 8', pin_signal: PIO4_12/XSPI2_DATA8/LP_FLEXCOMM9_P5/LCD_DATA8/LCD_DBI_DATA8, input_buffer: enable, pull_enable: enable}
  - {pin_num: E8, peripheral: XSPI2, signal: 'DATA, 9', pin_signal: PIO4_13/XSPI2_DATA9/LP_FLEXCOMM9_P6/LCD_D9/LCD_DBI_D9, input_buffer: enable, pull_enable: enable}
  - {pin_num: E12, peripheral: XSPI2, signal: 'DATA, 10', pin_signal: PIO4_14/XSPI2_DATA10/LP_FLEXCOMM10_P0/LCD_D10/LCD_DBI_D10, input_buffer: enable, pull_enable: enable}
  - {pin_num: E10, peripheral: XSPI2, signal: 'DATA, 11', pin_signal: PIO4_15/XSPI2_DATA11/LP_FLEXCOMM10_P1/LCD_D11/LCD_DBI_D11, input_buffer: enable, pull_enable: enable}
  - {pin_num: F12, peripheral: XSPI2, signal: 'DATA, 12', pin_signal: PIO4_17/XSPI2_DATA12/LP_FLEXCOMM10_P3/LCD_D12/LCD_DBI_D12, input_buffer: enable, pull_enable: enable}
  - {pin_num: E9, peripheral: XSPI2, signal: 'DATA, 13', pin_signal: PIO4_18/XSPI2_DATA13/LP_FLEXCOMM10_P4/LCD_D13/LCD_DBI_D13, input_buffer: enable, pull_enable: enable}
  - {pin_num: D12, peripheral: XSPI2, signal: 'DATA, 14', pin_signal: PIO4_19/XSPI2_DATA14/LP_FLEXCOMM10_P5/LCD_D14/LCD_DBI_D14, input_buffer: enable, pull_enable: enable}
  - {pin_num: D10, peripheral: XSPI2, signal: 'DATA, 15', pin_signal: PIO4_20/XSPI2_DATA15/LP_FLEXCOMM10_P6/LCD_D15/LCD_DBI_D15, input_buffer: enable, pull_enable: enable}
  - {pin_num: A10, peripheral: XSPI2, signal: DQS0, pin_signal: PIO4_5/XSPI2_DQS0/LP_FLEXCOMM8_P5, input_buffer: enable, pull_select: down, pull_enable: enable}
  - {pin_num: F10, peripheral: XSPI2, signal: DQS1, pin_signal: PIO4_16/XSPI2_DQS1/LP_FLEXCOMM10_P2, input_buffer: enable}
  - {pin_num: B10, peripheral: XSPI2, signal: SCLK0, pin_signal: PIO4_10/XSPI2_SCLK0/LP_FLEXCOMM9_P3, input_buffer: enable}
  - {pin_num: B11, peripheral: XSPI2, signal: SCLK0_N, pin_signal: PIO4_11/XSPI2_SCLK0_N/LP_FLEXCOMM9_P4/XSPI2_SS1_N, input_buffer: enable}
  - {pin_num: D8, peripheral: XSPI2, signal: SS0_N, pin_signal: PIO4_0/XSPI2_SS0_N/LP_FLEXCOMM8_P0, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

